{
    "testaments":[
        {
            "testament": "I’ve been a client of Mike since 2018 and I am really satisfied with their work, I was able to claim USD 8k in my Federal and USD 1k in my State tax refund.",
            "image": "",
            "name": "Alan Kahn",
            "job": "US Expat"
        },
        {
            "testament": "“Mike helped me save a little over $100,000 on taxes over the years. He now has me funded my health savings account, IRA account, health insurance for my whole family, and now working on a will. My financial life has been totally organized and sorted by Mike.”",
            "image": "Jeffrey_Libby.png",
            "name": "Jeffrey Libby",
            "job": "US Expat residing in Thailand"
        },
        {
            "testament": "I was able to save  $12k on 1040X Amended Tax return  just by having to answer the right questions on why 2017 was not filed as an expat when I left the US to the Philippines on Jan 6, 2017!  ",
            "image": "",
            "name": "Ashley Love",
            "job": "US Expat"
        },
        {
            "testament": "Michael is very helpful in preparing all of my taxes and dealing with IRS directly to make sure I didn't have to pay undue fees. he also helped advise on the optimal tax structure for me as expat in Asia as well. I would recommend Michael for other expats.",
            "image": "Jack_Chuang.png",
            "name": "Jack Chuang",
            "job": "Expat in Asia"
        },
        {
            "testament": "I highly recommend Mertz International Limited for their excellent service in handling our tax matters in Hong Kong and the USA. Michael Mertz, CPA, eMBA, and his team successfully tackled a tough situation in Hong Kong, where I am inappropriately paying taxes in HK, and was told that a refund wasn't possible. But through their efforts, a refund of over $50,000 was secured.",
            "image": "Joshua_Davies.png",
            "name": "Joshua Davies",
            "job": "Us Expat in HongKong"
        },
        {
            "testament": "He has managed to save me ~$7K+ USD on federal taxes and $2K+ USD (MA State) taxes after amending my 2013-2015 tax returns. Not only is the money being saved an obviously massive perk but the time I am able to save and overall confidence in \"getting it right\" has also been a huge save.",
            "image": "Colin_McKee.png",
            "name": "Colin McKee",
            "job": "US Expat"
        },
        {
            "testament": "Last year I asked Mike to take over my tax return preparations, and based on his advice we filed amended prior years' federal tax returns from which I received over $19,000 in refunds. I would recommend Mike without any hesitation.",
            "image": "Thomas_Shreve.png",
            "name": "Thomas W. Shreve",
            "job": "US Expat"
        },
        {
            "testament": "Working with Mike was a breeze and productive. He crafted amendments for 2013-2014 to move Foreign Taxes carryovers to 2015, saving me 30K+ USD in year 2015.",
            "image": "Ken_Sterns.png",
            "name": "Ken Stearns",
            "job": "US Expat"
        },
        {
            "testament": "I reached out to him when I couldn’t find someone in the States that knew how to handle looking at Chinese W2s and year-end tax reports. He was able to get the US to refund all of the taxes I paid to the Chinese government, even going back to my first year – 2006. He handled all of the financials surrounding my relocation in 2012 as well as when my wife moved to the US last year and had to bring all of her assets. It was complicated but we made it work and I really couldn’t have done it so cheaply without him.",
            "image": "Eric_Carlson.png",
            "name": "Eric Carlson",
            "job": "US Expat in China"
        },
        {
            "testament": "I have been an expatriate living in Europe since 1998 and have worked with several \"big name\" accounting firms and tax consultants in this time. The quality of the results that I have received from Mertz-International LLC is equal to what I have received from other providers, the service is more personal and the value for money is better.",
            "image": "Wes_Wosinski.png",
            "name": "Wes Wosinski",
            "job": "US Expat in Europe"
        }
    ]
}
